package javasyntax1;

/*
Напиши программу, которая выводит на экран надпись:
Это не баг, это фича.
Требования:

    •
    Программа должна выводить текст.
    •
    Текст должен начинаться с "Это не баг".
    •
    Текст должен заканчиваться точкой.
    •
    Текст должен состоять из 21 символа, включая пробелы и знаки препинания.
    •
    Выводимый текст должен соответствовать заданию.
 */

public class T0106 {
    public static void main(String[] args) {
        System.out.println("Это не баг, это фича.");

        //по тесту:

        //var name = "String"; //так компилятор даст
        //var name; //а так  - нет. не может понять что там за переменная по типу

        //Number - асбтрактный класс (да, есго наследюут оболочки, но базово целый числа хранятся в инте)

        //Java-компилятор после компиляции (javac *.java) выдает байт-код

    }
}
