package javasyntax1;

/*
Напиши программу, которая выводит на экран надпись:
Я думаю, быть программистом круто
Требования:

    •
    Программа должна выводить текст.
    •
    Текст должен начинаться с "Я думаю".
    •
    Текст должен заканчиваться на "круто".
    •
    Текст должен состоять из 33 символа, включая пробелы и знаки препинания.
    •
    Текст должен состоять из одной строки.
    •
    Выводимый текст должен соответствовать заданию.
 */

public class T0101 {
    public static void main(String[] args) {
        System.out.println("Я думаю, быть программистом круто");
    }
}
