package javasyntax2;

/*
\Объявление двух переменных

Объяви переменные a, b типа int.
Сразу же в строке объявления присвой им разные значения.
Значениями могут быть любые целые числа.
Требования:

    •
    Объяви две переменные типа int.
    •
    Имена переменных должны быть a и b.
    •
    Переменным сразу должны быть присвоены значения.
    •
    Переменные a и b должны иметь разные значения.
 */

public class T0109 {
    public static void main(String[] args) {
        int a = 1;
        int b = 2;
    }
}
