package javasyntax2;

/*
Объяви переменную name типа String.
Сразу же в строке объявления присвой ей какое-нибудь значение.
Выведи на экран переменную name.
Требования:

    •
    В методе main объяви переменную типа String.
    •
    Имя переменной должно быть name.
    •
    Переменной сразу должно быть присвоено значение.
    •
    Программа должна выводить текст на экран.
    •
    Выведенный текст должен быть значением переменной.
 */

public class T0110 {
    public static void main(String[] args) {
        String name = "JR";
        System.out.println(name);
    }
}
