package javasyntax2;

/*
Объяви переменные a, b типа int и переменную s типа String.
Сразу же в строке объявления присвой им любые значения.
Требования:

    •
    Объяви две переменные типа int.
    •
    Объяви одну переменную типа String.
    •
    Имена переменных типа int должны быть a и b.
    •
    Имя переменной типа String должно быть s.
    •
    Переменным сразу должны быть присвоены значения.
 */

public class T0111 {
    public static void main(String[] args) {
        int a = 1;
        int b = 2;
        String s = "123";
    }
}
