package javasyntax2;

/*
Поцелуй мой блестящий металлический зад

Первая программа "человеческих" студентов выводит на экран фразу "Hello World!".
А знаешь ли ты, что пишут брутальные робопрограммисты?
Только никому не рассказывай: "Поцелуй мой блестящий металлический зад!"
В этой задаче почувствуй себя настоящим робокодером и напиши программу, которая выведет на экран эту фразу.
Требования:

    •
    Программа должна выводить текст.
    •
    Текст должен начинаться с "Поцелуй".
    •
    Текст должен заканчиваться знаком восклицания.
    •
    Текст должен состоять из 40 символов, включая пробелы и знак восклицания.
    •
    Выводимый текст должен соответствовать заданию.
 */

public class T0139 {
    public static void main(String[] args) {
        System.out.println("Поцелуй мой блестящий металлический зад!");
    }
}
